isurki-tecnica/isurnode-firmware/ports/stm32/boards/ISURNODE/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME       "ISURNODE"
#define MICROPY_HW_MCU_NAME         "STM32L431CC"

#define MICROPY_EMIT_THUMB          (0)
#define MICROPY_EMIT_INLINE_THUMB   (0)
#define MICROPY_OPT_COMPUTED_GOTO   (0)
#define MICROPY_PY_BUILTINS_COMPLEX (0)
#define MICROPY_PY_GENERATOR_PEND_THROW (0)
#define MICROPY_PY_SOCKET           (0)
#define MICROPY_PY_NETWORK          (0)
#define MICROPY_PY_ONEWIRE          (0)
#define MICROPY_PY_STM              (0)
#define MICROPY_PY_PYB_LEGACY       (0)
#define MICROPY_PY_HEAPQ            (0)
#define MICROPY_PY_RE               (0)
#define MICROPY_PY_ASYNC_AWAIT      (0)
#define MICROPY_PY_MATH             (0)
#define MICROPY_PY_COLLECTIONS      (0)
#define MICROPY_PY_BUILTINS_SET     (0)


#define MICROPY_HW_ENABLE_RTC       (1)
#define MICROPY_HW_ENABLE_ADC       (0)
#define MICROPY_HW_ENABLE_DAC       (0)
#define MICROPY_PY_MACHINE_I2S      (0)
//#define MICROPY_HW_ENABLE_USB       (0) // requires a custom USB connector on PA11/PA12
#define MICROPY_HW_HAS_SWITCH       (0)
#define MICROPY_HW_HAS_FLASH        (1)
// MSI is used and is 4MHz
#define MICROPY_HW_CLK_PLLM (1)
#define MICROPY_HW_CLK_PLLN (16)
#define MICROPY_HW_CLK_PLLR (2)
#define MICROPY_HW_CLK_PLLP (7)
#define MICROPY_HW_CLK_PLLQ (2)

// The board has an external 32kHz crystal

#define MICROPY_HW_RTC_USE_LSE      (1)

// UART config
// USART3 is used for the REPL
#define MICROPY_HW_UART3_TX     (pin_B10)
#define MICROPY_HW_UART3_RX     (pin_B11)

// LPUART1 is used for Modbus
#define MICROPY_HW_LPUART1_TX   (pin_A2)
#define MICROPY_HW_LPUART1_RX   (pin_A3)

// Make the REPL available on USART3
#define MICROPY_HW_UART_REPL        PYB_UART_3
#define MICROPY_HW_UART_REPL_BAUD   115200

#define MICROPY_HW_FLASH_LATENCY    FLASH_LATENCY_4

// I2C buses
#define MICROPY_HW_I2C1_SCL (pin_B8)
#define MICROPY_HW_I2C1_SDA (pin_B9)
//#define MICROPY_HW_I2C3_SCL (pin_A7)
//#define MICROPY_HW_I2C3_SDA (pin_B4)

// SPI buses
/*
#define MICROPY_HW_SPI1_NSS     (pin_B0)
#define MICROPY_HW_SPI1_SCK     (pin_A5)
#define MICROPY_HW_SPI1_MISO    (pin_A6)
#define MICROPY_HW_SPI1_MOSI    (pin_A7)
#define MICROPY_HW_SPI3_NSS     (pin_A4)
#define MICROPY_HW_SPI3_SCK     (pin_B3)
#define MICROPY_HW_SPI3_MISO    (pin_B4)
#define MICROPY_HW_SPI3_MOSI    (pin_B5)
*/

// LEDs
#define MICROPY_HW_LED1             (pin_B0) //TX LED
#define MICROPY_HW_LED2             (pin_B15) //RX LED
#define MICROPY_HW_LED_ON(pin)      (mp_hal_pin_high(pin))
#define MICROPY_HW_LED_OFF(pin)     (mp_hal_pin_low(pin))

// USB config
//#define MICROPY_HW_USB_FS           (MICROPY_HW_ENABLE_USB)
//#define MICROPY_HW_USB_MSC          (0)
//#define MICROPY_HW_USB_HID          (0)
//#define MICROPY_HW_USB_CDC_RX_DATA_SIZE (256)
//#define MICROPY_HW_USB_CDC_TX_DATA_SIZE (256)

